---
title: ExportLayerTableIterator
classe: Autodesk.Revit.DB.ExportLayerTableIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ExportLayerTableIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `KeyValuePair<ExportLayerKey, ExportLayerInfo> Current { get; }` | `exportLayerTableIterator.Current` | KeyValuePair<ExportLayerKey, ExportLayerInfo> |
| `Boolean IsValidObject { get; }` | `exportLayerTableIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `exportLayerTableIterator.Dispose()` | Void |
| `Boolean IsDone()` | `exportLayerTableIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `exportLayerTableIterator.MoveNext()` | Boolean |
| `Void Reset()` | `exportLayerTableIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```